Revit 2027 API
TableSectionData.IsCellOverridden(Int32, Int32) Method
 Indicates if the cell is overridden or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsCellOverridden(
	int nRow,
	int nCol
)
Public Function IsCellOverridden (
	nRow As Integer,
	nCol As Integer
) As Boolean
public:
bool IsCellOverridden(
	int nRow,
	int nCol
)
member IsCellOverridden :
        nRow : int *
        nCol : int -> bool
Parameters
nRow Int32
nCol Int32
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentException |  The given row number nRow is invalid. -or- The given column number nCol is invalid.
See Also
Reference
TableSectionData Class
IsCellOverridden Overload
Autodesk.Revit.DB Namespace